GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile RXF5EID8bits_t RXF5EID8bits __at(0xF16);
// bitfield macros
#define _RXF5EID8_EID8_POSN                                 0x0
#define _RXF5EID8_EID8_POSITION                             0x0
#define _RXF5EID8_EID8_SIZE                                 0x1
#define _RXF5EID8_EID8_LENGTH                               0x1
#define _RXF5EID8_EID8_MASK                                 0x1
#define _RXF5EID8_EID9_POSN                                 0x1
#define _RXF5EID8_EID9_POSITION                             0x1
#define _RXF5EID8_EID9_SIZE                                 0x1
#define _RXF5EID8_EID9_LENGTH                               0x1
#define _RXF5EID8_EID9_MASK                                 0x2
#define _RXF5EID8_EID10_POSN                                0x2
#define _RXF5EID8_EID10_POSITION                            0x2
#define _RXF5EID8_EID10_SIZE                                0x1
#define _RXF5EID8_EID10_LENGTH                              0x1
#define _RXF5EID8_EID10_MASK                                0x4
#define _RXF5EID8_EID11_POSN                                0x3
#define _RXF5EID8_EID11_POSITION                            0x3
#define _RXF5EID8_EID11_SIZE                                0x1
#define _RXF5EID8_EID11_LENGTH                              0x1
#define _RXF5EID8_EID11_MASK                                0x8
#define _RXF5EID8_EID12_POSN                                0x4
#define _RXF5EID8_EID12_POSITION                            0x4
#define _RXF5EID8_EID12_SIZE                                0x1
#define _RXF5EID8_EID12_LENGTH                              0x1
#define _RXF5EID8_EID12_MASK                                0x10
#define _RXF5EID8_EID13_POSN                                0x5
#define _RXF5EID8_EID13_POSITION                            0x5
#define _RXF5EID8_EID13_SIZE                                0x1
#define _RXF5EID8_EID13_LENGTH                              0x1
#define _RXF5EID8_EID13_MASK                                0x20
#define _RXF5EID8_EID14_POSN                                0x6
#define _RXF5EID8_EID14_POSITION                            0x6
#define _RXF5EID8_EID14_SIZE                                0x1
#define _RXF5EID8_EID14_LENGTH                              0x1
#define _RXF5EID8_EID14_MASK                                0x40
#define _RXF5EID8_EID15_POSN                                0x7
#define _RXF5EID8_EID15_POSITION                            0x7
#define _RXF5EID8_EID15_SIZE                                0x1
#define _RXF5EID8_EID15_LENGTH                              0x1
#define _RXF5EID8_EID15_MASK                                0x80
#define _RXF5EID8_RXF5EID8_POSN                             0x0
#define _RXF5EID8_RXF5EID8_POSITION                         0x0
#define _RXF5EID8_RXF5EID8_SIZE                             0x1
#define _RXF5EID8_RXF5EID8_LENGTH                           0x1
#define _RXF5EID8_RXF5EID8_MASK                             0x1
#define _RXF5EID8_RXF5EID9_POSN                             0x1
#define _RXF5EID8_RXF5EID9_POSITION                         0x1
#define _RXF5EID8_RXF5EID9_SIZE                             0x1
#define _RXF5EID8_RXF5EID9_LENGTH                           0x1
#define _RXF5EID8_RXF5EID9_MASK                             0x2
#define _RXF5EID8_RXF5EID10_POSN                            0x2
#define _RXF5EID8_RXF5EID10_POSITION                        0x2
#define _RXF5EID8_RXF5EID10_SIZE                            0x1
#define _RXF5EID8_RXF5EID10_LENGTH                          0x1
#define _RXF5EID8_RXF5EID10_MASK                            0x4
#define _RXF5EID8_RXF5EID11_POSN                            0x3
#define _RXF5EID8_RXF5EID11_POSITION                        0x3
#define _RXF5EID8_RXF5EID11_SIZE                            0x1
#define _RXF5EID8_RXF5EID11_LENGTH                          0x1
#define _RXF5EID8_RXF5EID11_MASK                            0x8
#define _RXF5EID8_RXF5EID12_POSN                            0x4
#define _RXF5EID8_RXF5EID12_POSITION                        0x4
#define _RXF5EID8_RXF5EID12_SIZE                            0x1
#define _RXF5EID8_RXF5EID12_LENGTH                          0x1
#define _RXF5EID8_RXF5EID12_MASK                            0x10
#define _RXF5EID8_RXF5EID13_POSN                            0x5
#define _RXF5EID8_RXF5EID13_POSITION                        0x5
#define _RXF5EID8_RXF5EID13_SIZE                            0x1
#define _RXF5EID8_RXF5EID13_LENGTH                          0x1
#define _RXF5EID8_RXF5EID13_MASK                            0x20
#define _RXF5EID8_RXF5EID14_POSN                            0x6
#define _RXF5EID8_RXF5EID14_POSITION                        0x6
#define _RXF5EID8_RXF5EID14_SIZE                            0x1
#define _RXF5EID8_RXF5EID14_LENGTH                          0x1
#define _RXF5EID8_RXF5EID14_MASK                            0x40
#define _RXF5EID8_RXF5EID15_POSN                            0x7
#define _RXF5EID8_RXF5EID15_POSITION                        0x7
#define _RXF5EID8_RXF5EID15_SIZE                            0x1
#define _RXF5EID8_RXF5EID15_LENGTH                          0x1
#define _RXF5EID8_RXF5EID15_MASK                            0x80

// Register: RXF5EIDL
#define RXF5EIDL RXF5EIDL
extern volatile unsigned char           RXF5EIDL            __at(0xF17);
#ifndef _LIB_BUILD
asm("RXF5EIDL equ 0F17h");
#endif
// aliases
extern volatile unsigned char           RXF5EID0            __at(0xF17);
#ifndef _LIB_BUILD
asm("RXF5EID0 equ 0F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF5EID0               :1;
        unsigned RXF5EID1               :1;
        unsigned RXF5EID2               :1;
        unsigned RXF5EID3               :1;
        unsigned RXF5EID4               :1;
        unsigned RXF5EID5               :1;
        unsigned RXF5EID6               :1;
        unsigned RXF5EID7               :1;
    };
} RXF5EIDLbits_t;
