GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile RXM1EID8bits_t RXM1EID8bits __at(0xF1E);
// bitfield macros
#define _RXM1EID8_EID8_POSN                                 0x0
#define _RXM1EID8_EID8_POSITION                             0x0
#define _RXM1EID8_EID8_SIZE                                 0x1
#define _RXM1EID8_EID8_LENGTH                               0x1
#define _RXM1EID8_EID8_MASK                                 0x1
#define _RXM1EID8_EID9_POSN                                 0x1
#define _RXM1EID8_EID9_POSITION                             0x1
#define _RXM1EID8_EID9_SIZE                                 0x1
#define _RXM1EID8_EID9_LENGTH                               0x1
#define _RXM1EID8_EID9_MASK                                 0x2
#define _RXM1EID8_EID10_POSN                                0x2
#define _RXM1EID8_EID10_POSITION                            0x2
#define _RXM1EID8_EID10_SIZE                                0x1
#define _RXM1EID8_EID10_LENGTH                              0x1
#define _RXM1EID8_EID10_MASK                                0x4
#define _RXM1EID8_EID11_POSN                                0x3
#define _RXM1EID8_EID11_POSITION                            0x3
#define _RXM1EID8_EID11_SIZE                                0x1
#define _RXM1EID8_EID11_LENGTH                              0x1
#define _RXM1EID8_EID11_MASK                                0x8
#define _RXM1EID8_EID12_POSN                                0x4
#define _RXM1EID8_EID12_POSITION                            0x4
#define _RXM1EID8_EID12_SIZE                                0x1
#define _RXM1EID8_EID12_LENGTH                              0x1
#define _RXM1EID8_EID12_MASK                                0x10
#define _RXM1EID8_EID13_POSN                                0x5
#define _RXM1EID8_EID13_POSITION                            0x5
#define _RXM1EID8_EID13_SIZE                                0x1
#define _RXM1EID8_EID13_LENGTH                              0x1
#define _RXM1EID8_EID13_MASK                                0x20
#define _RXM1EID8_EID14_POSN                                0x6
#define _RXM1EID8_EID14_POSITION                            0x6
#define _RXM1EID8_EID14_SIZE                                0x1
#define _RXM1EID8_EID14_LENGTH                              0x1
#define _RXM1EID8_EID14_MASK                                0x40
#define _RXM1EID8_EID15_POSN                                0x7
#define _RXM1EID8_EID15_POSITION                            0x7
#define _RXM1EID8_EID15_SIZE                                0x1
#define _RXM1EID8_EID15_LENGTH                              0x1
#define _RXM1EID8_EID15_MASK                                0x80
#define _RXM1EID8_RXM1EID8_POSN                             0x0
#define _RXM1EID8_RXM1EID8_POSITION                         0x0
#define _RXM1EID8_RXM1EID8_SIZE                             0x1
#define _RXM1EID8_RXM1EID8_LENGTH                           0x1
#define _RXM1EID8_RXM1EID8_MASK                             0x1
#define _RXM1EID8_RXM1EID9_POSN                             0x1
#define _RXM1EID8_RXM1EID9_POSITION                         0x1
#define _RXM1EID8_RXM1EID9_SIZE                             0x1
#define _RXM1EID8_RXM1EID9_LENGTH                           0x1
#define _RXM1EID8_RXM1EID9_MASK                             0x2
#define _RXM1EID8_RXM1EID10_POSN                            0x2
#define _RXM1EID8_RXM1EID10_POSITION                        0x2
#define _RXM1EID8_RXM1EID10_SIZE                            0x1
#define _RXM1EID8_RXM1EID10_LENGTH                          0x1
#define _RXM1EID8_RXM1EID10_MASK                            0x4
#define _RXM1EID8_RXM1EID11_POSN                            0x3
#define _RXM1EID8_RXM1EID11_POSITION                        0x3
#define _RXM1EID8_RXM1EID11_SIZE                            0x1
#define _RXM1EID8_RXM1EID11_LENGTH                          0x1
#define _RXM1EID8_RXM1EID11_MASK                            0x8
#define _RXM1EID8_RXM1EID12_POSN                            0x4
#define _RXM1EID8_RXM1EID12_POSITION                        0x4
#define _RXM1EID8_RXM1EID12_SIZE                            0x1
#define _RXM1EID8_RXM1EID12_LENGTH                          0x1
#define _RXM1EID8_RXM1EID12_MASK                            0x10
#define _RXM1EID8_RXM1EID13_POSN                            0x5
#define _RXM1EID8_RXM1EID13_POSITION                        0x5
#define _RXM1EID8_RXM1EID13_SIZE                            0x1
#define _RXM1EID8_RXM1EID13_LENGTH                          0x1
#define _RXM1EID8_RXM1EID13_MASK                            0x20
#define _RXM1EID8_RXM1EID14_POSN                            0x6
#define _RXM1EID8_RXM1EID14_POSITION                        0x6
#define _RXM1EID8_RXM1EID14_SIZE                            0x1
#define _RXM1EID8_RXM1EID14_LENGTH                          0x1
#define _RXM1EID8_RXM1EID14_MASK                            0x40
#define _RXM1EID8_RXM1EID15_POSN                            0x7
#define _RXM1EID8_RXM1EID15_POSITION                        0x7
#define _RXM1EID8_RXM1EID15_SIZE                            0x1
#define _RXM1EID8_RXM1EID15_LENGTH                          0x1
#define _RXM1EID8_RXM1EID15_MASK                            0x80

// Register: RXM1EIDL
#define RXM1EIDL RXM1EIDL
extern volatile unsigned char           RXM1EIDL            __at(0xF1F);
#ifndef _LIB_BUILD
asm("RXM1EIDL equ 0F1Fh");
#endif
// aliases
extern volatile unsigned char           RXM1EID0            __at(0xF1F);
#ifndef _LIB_BUILD
asm("RXM1EID0 equ 0F1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXM1EID0               :1;
        unsigned RXM1EID1               :1;
        unsigned RXM1EID2               :1;
        unsigned RXM1EID3               :1;
        unsigned RXM1EID4               :1;
        unsigned RXM1EID5               :1;
        unsigned RXM1EID6               :1;
        unsigned RXM1EID7               :1;
    };
} RXM1EIDLbits_t;
extern volatile RXM1EIDLbits_t RXM1EIDLbits __at(0xF1F);
// bitfield macros
#define _RXM1EIDL_EID0_POSN                                 0x0
#define _RXM1EIDL_EID0_POSITION                             0x0
#define _RXM1EIDL_EID0_SIZE                                 0x1
#define _RXM1EIDL_EID0_LENGTH                               0x1
#define _RXM1EIDL_EID0_MASK                                 0x1
#define _RXM1EIDL_EID1_POSN                                 0x1
#define _RXM1EIDL_EID1_POSITION                             0x1
#define _RXM1EIDL_EID1_SIZE                                 0x1
#define _RXM1EIDL_EID1_LENGTH                               0x1
#define _RXM1EIDL_EID1_MASK                                 0x2
#define _RXM1EIDL_EID2_POSN                                 0x2
#define _RXM1EIDL_EID2_POSITION                             0x2
#define _RXM1EIDL_EID2_SIZE                                 0x1
#define _RXM1EIDL_EID2_LENGTH                               0x1
#define _RXM1EIDL_EID2_MASK                                 0x4
#define _RXM1EIDL_EID3_POSN                                 0x3
#define _RXM1EIDL_EID3_POSITION                             0x3
#define _RXM1EIDL_EID3_SIZE                                 0x1
#define _RXM1EIDL_EID3_LENGTH                               0x1
#define _RXM1EIDL_EID3_MASK                                 0x8
#define _RXM1EIDL_EID4_POSN                                 0x4
#define _RXM1EIDL_EID4_POSITION                             0x4
#define _RXM1EIDL_EID4_SIZE                                 0x1
#define _RXM1EIDL_EID4_LENGTH                               0x1
#define _RXM1EIDL_EID4_MASK                                 0x10
#define _RXM1EIDL_EID5_POSN                                 0x5
#define _RXM1EIDL_EID5_POSITION                             0x5
#define _RXM1EIDL_EID5_SIZE                                 0x1
#define _RXM1EIDL_EID5_LENGTH                               0x1
#define _RXM1EIDL_EID5_MASK                                 0x20
#define _RXM1EIDL_EID6_POSN                                 0x6
#define _RXM1EIDL_EID6_POSITION                             0x6
#define _RXM1EIDL_EID6_SIZE                                 0x1
#define _RXM1EIDL_EID6_LENGTH                               0x1
#define _RXM1EIDL_EID6_MASK                                 0x40
#define _RXM1EIDL_EID7_POSN                                 0x7
#define _RXM1EIDL_EID7_POSITION                             0x7
#define _RXM1EIDL_EID7_SIZE                                 0x1
#define _RXM1EIDL_EID7_LENGTH                               0x1
#define _RXM1EIDL_EID7_MASK                                 0x80
#define _RXM1EIDL_RXM1EID0_POSN                             0x0
#define _RXM1EIDL_RXM1EID0_POSITION                         0x0
#define _RXM1EIDL_RXM1EID0_SIZE                             0x1
#define _RXM1EIDL_RXM1EID0_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID0_MASK                             0x1
#define _RXM1EIDL_RXM1EID1_POSN                             0x1
#define _RXM1EIDL_RXM1EID1_POSITION                         0x1
#define _RXM1EIDL_RXM1EID1_SIZE                             0x1
#define _RXM1EIDL_RXM1EID1_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID1_MASK                             0x2
#define _RXM1EIDL_RXM1EID2_POSN                             0x2
#define _RXM1EIDL_RXM1EID2_POSITION                         0x2
#define _RXM1EIDL_RXM1EID2_SIZE                             0x1
#define _RXM1EIDL_RXM1EID2_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID2_MASK                             0x4
#define _RXM1EIDL_RXM1EID3_POSN                             0x3
#define _RXM1EIDL_RXM1EID3_POSITION                         0x3
#define _RXM1EIDL_RXM1EID3_SIZE                             0x1
#define _RXM1EIDL_RXM1EID3_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID3_MASK                             0x8
#define _RXM1EIDL_RXM1EID4_POSN                             0x4
#define _RXM1EIDL_RXM1EID4_POSITION                         0x4
#define _RXM1EIDL_RXM1EID4_SIZE                             0x1
#define _RXM1EIDL_RXM1EID4_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID4_MASK                             0x10
#define _RXM1EIDL_RXM1EID5_POSN                             0x5
#define _RXM1EIDL_RXM1EID5_POSITION                         0x5
#define _RXM1EIDL_RXM1EID5_SIZE                             0x1
#define _RXM1EIDL_RXM1EID5_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID5_MASK                             0x20
#define _RXM1EIDL_RXM1EID6_POSN                             0x6
#define _RXM1EIDL_RXM1EID6_POSITION                         0x6
#define _RXM1EIDL_RXM1EID6_SIZE                             0x1
#define _RXM1EIDL_RXM1EID6_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID6_MASK                             0x40
#define _RXM1EIDL_RXM1EID7_POSN                             0x7
#define _RXM1EIDL_RXM1EID7_POSITION                         0x7
#define _RXM1EIDL_RXM1EID7_SIZE                             0x1
#define _RXM1EIDL_RXM1EID7_LENGTH                           0x1
#define _RXM1EIDL_RXM1EID7_MASK                             0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXM1EID0               :1;
        unsigned RXM1EID1               :1;
        unsigned RXM1EID2               :1;
        unsigned RXM1EID3               :1;
        unsigned RXM1EID4               :1;
        unsigned RXM1EID5               :1;
        unsigned RXM1EID6               :1;
        unsigned RXM1EID7               :1;
    };
} RXM1EID0bits_t;
