GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile TXB1D1bits_t TXB1D1bits __at(0xF37);
// bitfield macros
#define _TXB1D1_TXB1D10_POSN                                0x0
#define _TXB1D1_TXB1D10_POSITION                            0x0
#define _TXB1D1_TXB1D10_SIZE                                0x1
#define _TXB1D1_TXB1D10_LENGTH                              0x1
#define _TXB1D1_TXB1D10_MASK                                0x1
#define _TXB1D1_TXB1D11_POSN                                0x1
#define _TXB1D1_TXB1D11_POSITION                            0x1
#define _TXB1D1_TXB1D11_SIZE                                0x1
#define _TXB1D1_TXB1D11_LENGTH                              0x1
#define _TXB1D1_TXB1D11_MASK                                0x2
#define _TXB1D1_TXB1D12_POSN                                0x2
#define _TXB1D1_TXB1D12_POSITION                            0x2
#define _TXB1D1_TXB1D12_SIZE                                0x1
#define _TXB1D1_TXB1D12_LENGTH                              0x1
#define _TXB1D1_TXB1D12_MASK                                0x4
#define _TXB1D1_TXB1D13_POSN                                0x3
#define _TXB1D1_TXB1D13_POSITION                            0x3
#define _TXB1D1_TXB1D13_SIZE                                0x1
#define _TXB1D1_TXB1D13_LENGTH                              0x1
#define _TXB1D1_TXB1D13_MASK                                0x8
#define _TXB1D1_TXB1D14_POSN                                0x4
#define _TXB1D1_TXB1D14_POSITION                            0x4
#define _TXB1D1_TXB1D14_SIZE                                0x1
#define _TXB1D1_TXB1D14_LENGTH                              0x1
#define _TXB1D1_TXB1D14_MASK                                0x10
#define _TXB1D1_TXB1D15_POSN                                0x5
#define _TXB1D1_TXB1D15_POSITION                            0x5
#define _TXB1D1_TXB1D15_SIZE                                0x1
#define _TXB1D1_TXB1D15_LENGTH                              0x1
#define _TXB1D1_TXB1D15_MASK                                0x20
#define _TXB1D1_TXB1D16_POSN                                0x6
#define _TXB1D1_TXB1D16_POSITION                            0x6
#define _TXB1D1_TXB1D16_SIZE                                0x1
#define _TXB1D1_TXB1D16_LENGTH                              0x1
#define _TXB1D1_TXB1D16_MASK                                0x40
#define _TXB1D1_TXB1D17_POSN                                0x7
#define _TXB1D1_TXB1D17_POSITION                            0x7
#define _TXB1D1_TXB1D17_SIZE                                0x1
#define _TXB1D1_TXB1D17_LENGTH                              0x1
#define _TXB1D1_TXB1D17_MASK                                0x80

// Register: TXB1D2
#define TXB1D2 TXB1D2
extern volatile unsigned char           TXB1D2              __at(0xF38);
#ifndef _LIB_BUILD
asm("TXB1D2 equ 0F38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D20                :1;
        unsigned TXB1D21                :1;
        unsigned TXB1D22                :1;
        unsigned TXB1D23                :1;
        unsigned TXB1D24                :1;
        unsigned TXB1D25                :1;
        unsigned TXB1D26                :1;
        unsigned TXB1D27                :1;
    };
    struct {
        unsigned                        :3;
        unsigned TBB1D23                :1;
    };
} TXB1D2bits_t;
extern volatile TXB1D2bits_t TXB1D2bits __at(0xF38);
// bitfield macros
#define _TXB1D2_TXB1D20_POSN                                0x0
#define _TXB1D2_TXB1D20_POSITION                            0x0
#define _TXB1D2_TXB1D20_SIZE                                0x1
#define _TXB1D2_TXB1D20_LENGTH                              0x1
#define _TXB1D2_TXB1D20_MASK                                0x1
#define _TXB1D2_TXB1D21_POSN                                0x1
#define _TXB1D2_TXB1D21_POSITION                            0x1
#define _TXB1D2_TXB1D21_SIZE                                0x1
#define _TXB1D2_TXB1D21_LENGTH                              0x1
#define _TXB1D2_TXB1D21_MASK                                0x2
#define _TXB1D2_TXB1D22_POSN                                0x2
#define _TXB1D2_TXB1D22_POSITION                            0x2
#define _TXB1D2_TXB1D22_SIZE                                0x1
#define _TXB1D2_TXB1D22_LENGTH                              0x1
#define _TXB1D2_TXB1D22_MASK                                0x4
#define _TXB1D2_TXB1D23_POSN                                0x3
#define _TXB1D2_TXB1D23_POSITION                            0x3
#define _TXB1D2_TXB1D23_SIZE                                0x1
#define _TXB1D2_TXB1D23_LENGTH                              0x1
#define _TXB1D2_TXB1D23_MASK                                0x8
#define _TXB1D2_TXB1D24_POSN                                0x4
#define _TXB1D2_TXB1D24_POSITION                            0x4
#define _TXB1D2_TXB1D24_SIZE                                0x1
#define _TXB1D2_TXB1D24_LENGTH                              0x1
#define _TXB1D2_TXB1D24_MASK                                0x10
#define _TXB1D2_TXB1D25_POSN                                0x5
#define _TXB1D2_TXB1D25_POSITION                            0x5
#define _TXB1D2_TXB1D25_SIZE                                0x1
#define _TXB1D2_TXB1D25_LENGTH                              0x1
#define _TXB1D2_TXB1D25_MASK                                0x20
#define _TXB1D2_TXB1D26_POSN                                0x6
#define _TXB1D2_TXB1D26_POSITION                            0x6
#define _TXB1D2_TXB1D26_SIZE                                0x1
#define _TXB1D2_TXB1D26_LENGTH                              0x1
#define _TXB1D2_TXB1D26_MASK                                0x40
#define _TXB1D2_TXB1D27_POSN                                0x7
#define _TXB1D2_TXB1D27_POSITION                            0x7
#define _TXB1D2_TXB1D27_SIZE                                0x1
#define _TXB1D2_TXB1D27_LENGTH                              0x1
#define _TXB1D2_TXB1D27_MASK                                0x80
#define _TXB1D2_TBB1D23_POSN                                0x3
#define _TXB1D2_TBB1D23_POSITION                            0x3
#define _TXB1D2_TBB1D23_SIZE                                0x1
#define _TXB1D2_TBB1D23_LENGTH                              0x1
#define _TXB1D2_TBB1D23_MASK                                0x8

// Register: TXB1D3
#define TXB1D3 TXB1D3
extern volatile unsigned char           TXB1D3              __at(0xF39);
#ifndef _LIB_BUILD
asm("TXB1D3 equ 0F39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D30                :1;
        unsigned TXB1D31                :1;
        unsigned TXB1D32                :1;
        unsigned TXB1D33                :1;
        unsigned TXB1D34                :1;
        unsigned TXB1D35                :1;
        unsigned TXB1D36                :1;
        unsigned TXB1D37                :1;
    };
} TXB1D3bits_t;
extern volatile TXB1D3bits_t TXB1D3bits __at(0xF39);
// bitfield macros
#define _TXB1D3_TXB1D30_POSN                                0x0
#define _TXB1D3_TXB1D30_POSITION                            0x0
#define _TXB1D3_TXB1D30_SIZE                                0x1
#define _TXB1D3_TXB1D30_LENGTH                              0x1
#define _TXB1D3_TXB1D30_MASK                                0x1
#define _TXB1D3_TXB1D31_POSN                                0x1
#define _TXB1D3_TXB1D31_POSITION                            0x1
#define _TXB1D3_TXB1D31_SIZE                                0x1
#define _TXB1D3_TXB1D31_LENGTH                              0x1
#define _TXB1D3_TXB1D31_MASK                                0x2
#define _TXB1D3_TXB1D32_POSN                                0x2
#define _TXB1D3_TXB1D32_POSITION                            0x2
#define _TXB1D3_TXB1D32_SIZE                                0x1
#define _TXB1D3_TXB1D32_LENGTH                              0x1
#define _TXB1D3_TXB1D32_MASK                                0x4
#define _TXB1D3_TXB1D33_POSN                                0x3
#define _TXB1D3_TXB1D33_POSITION                            0x3
#define _TXB1D3_TXB1D33_SIZE                                0x1
#define _TXB1D3_TXB1D33_LENGTH                              0x1
#define _TXB1D3_TXB1D33_MASK                                0x8
#define _TXB1D3_TXB1D34_POSN                                0x4
#define _TXB1D3_TXB1D34_POSITION                            0x4
#define _TXB1D3_TXB1D34_SIZE                                0x1
#define _TXB1D3_TXB1D34_LENGTH                              0x1
#define _TXB1D3_TXB1D34_MASK                                0x10
#define _TXB1D3_TXB1D35_POSN                                0x5
#define _TXB1D3_TXB1D35_POSITION                            0x5
#define _TXB1D3_TXB1D35_SIZE                                0x1
#define _TXB1D3_TXB1D35_LENGTH                              0x1
#define _TXB1D3_TXB1D35_MASK                                0x20
#define _TXB1D3_TXB1D36_POSN                                0x6
#define _TXB1D3_TXB1D36_POSITION                            0x6
#define _TXB1D3_TXB1D36_SIZE                                0x1
#define _TXB1D3_TXB1D36_LENGTH                              0x1
#define _TXB1D3_TXB1D36_MASK                                0x40
#define _TXB1D3_TXB1D37_POSN                                0x7
#define _TXB1D3_TXB1D37_POSITION                            0x7
#define _TXB1D3_TXB1D37_SIZE                                0x1
#define _TXB1D3_TXB1D37_LENGTH                              0x1
#define _TXB1D3_TXB1D37_MASK                                0x80

// Register: TXB1D4
#define TXB1D4 TXB1D4
extern volatile unsigned char           TXB1D4              __at(0xF3A);
#ifndef _LIB_BUILD
asm("TXB1D4 equ 0F3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D40                :1;
        unsigned TXB1D41                :1;
        unsigned TXB1D42                :1;
        unsigned TXB1D43                :1;
        unsigned TXB1D44                :1;
        unsigned TXB1D45                :1;
        unsigned TXB1D46                :1;
        unsigned TXB1D47                :1;
    };
} TXB1D4bits_t;
