GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile LATKbits_t LATKbits __at(0xF7E);
// bitfield macros
#define _LATK_LATK0_POSN                                    0x0
#define _LATK_LATK0_POSITION                                0x0
#define _LATK_LATK0_SIZE                                    0x1
#define _LATK_LATK0_LENGTH                                  0x1
#define _LATK_LATK0_MASK                                    0x1
#define _LATK_LATK1_POSN                                    0x1
#define _LATK_LATK1_POSITION                                0x1
#define _LATK_LATK1_SIZE                                    0x1
#define _LATK_LATK1_LENGTH                                  0x1
#define _LATK_LATK1_MASK                                    0x2
#define _LATK_LATK2_POSN                                    0x2
#define _LATK_LATK2_POSITION                                0x2
#define _LATK_LATK2_SIZE                                    0x1
#define _LATK_LATK2_LENGTH                                  0x1
#define _LATK_LATK2_MASK                                    0x4
#define _LATK_LATK3_POSN                                    0x3
#define _LATK_LATK3_POSITION                                0x3
#define _LATK_LATK3_SIZE                                    0x1
#define _LATK_LATK3_LENGTH                                  0x1
#define _LATK_LATK3_MASK                                    0x8
#define _LATK_LATK4_POSN                                    0x4
#define _LATK_LATK4_POSITION                                0x4
#define _LATK_LATK4_SIZE                                    0x1
#define _LATK_LATK4_LENGTH                                  0x1
#define _LATK_LATK4_MASK                                    0x10
#define _LATK_LATK5_POSN                                    0x5
#define _LATK_LATK5_POSITION                                0x5
#define _LATK_LATK5_SIZE                                    0x1
#define _LATK_LATK5_LENGTH                                  0x1
#define _LATK_LATK5_MASK                                    0x20
#define _LATK_LATK6_POSN                                    0x6
#define _LATK_LATK6_POSITION                                0x6
#define _LATK_LATK6_SIZE                                    0x1
#define _LATK_LATK6_LENGTH                                  0x1
#define _LATK_LATK6_MASK                                    0x40
#define _LATK_LATK7_POSN                                    0x7
#define _LATK_LATK7_POSITION                                0x7
#define _LATK_LATK7_SIZE                                    0x1
#define _LATK_LATK7_LENGTH                                  0x1
#define _LATK_LATK7_MASK                                    0x80
#define _LATK_LK0_POSN                                      0x0
#define _LATK_LK0_POSITION                                  0x0
#define _LATK_LK0_SIZE                                      0x1
#define _LATK_LK0_LENGTH                                    0x1
#define _LATK_LK0_MASK                                      0x1
#define _LATK_LK1_POSN                                      0x1
#define _LATK_LK1_POSITION                                  0x1
#define _LATK_LK1_SIZE                                      0x1
#define _LATK_LK1_LENGTH                                    0x1
#define _LATK_LK1_MASK                                      0x2
#define _LATK_LK2_POSN                                      0x2
#define _LATK_LK2_POSITION                                  0x2
#define _LATK_LK2_SIZE                                      0x1
#define _LATK_LK2_LENGTH                                    0x1
#define _LATK_LK2_MASK                                      0x4
#define _LATK_LK3_POSN                                      0x3
#define _LATK_LK3_POSITION                                  0x3
#define _LATK_LK3_SIZE                                      0x1
#define _LATK_LK3_LENGTH                                    0x1
#define _LATK_LK3_MASK                                      0x8
#define _LATK_LK4_POSN                                      0x4
#define _LATK_LK4_POSITION                                  0x4
#define _LATK_LK4_SIZE                                      0x1
#define _LATK_LK4_LENGTH                                    0x1
#define _LATK_LK4_MASK                                      0x10
#define _LATK_LK5_POSN                                      0x5
#define _LATK_LK5_POSITION                                  0x5
#define _LATK_LK5_SIZE                                      0x1
#define _LATK_LK5_LENGTH                                    0x1
#define _LATK_LK5_MASK                                      0x20
#define _LATK_LK6_POSN                                      0x6
#define _LATK_LK6_POSITION                                  0x6
#define _LATK_LK6_SIZE                                      0x1
#define _LATK_LK6_LENGTH                                    0x1
#define _LATK_LK6_MASK                                      0x40
#define _LATK_LK7_POSN                                      0x7
#define _LATK_LK7_POSITION                                  0x7
#define _LATK_LK7_SIZE                                      0x1
#define _LATK_LK7_LENGTH                                    0x1
#define _LATK_LK7_MASK                                      0x80

// Register: TRISK
#define TRISK TRISK
extern volatile unsigned char           TRISK               __at(0xF7F);
#ifndef _LIB_BUILD
asm("TRISK equ 0F7Fh");
#endif
// aliases
extern volatile unsigned char           DDRK                __at(0xF7F);
#ifndef _LIB_BUILD
asm("DDRK equ 0F7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISK0                 :1;
        unsigned TRISK1                 :1;
        unsigned TRISK2                 :1;
        unsigned TRISK3                 :1;
        unsigned TRISK4                 :1;
        unsigned TRISK5                 :1;
        unsigned TRISK6                 :1;
        unsigned TRISK7                 :1;
    };
    struct {
        unsigned RK0                    :1;
        unsigned RK1                    :1;
        unsigned RK2                    :1;
        unsigned RK3                    :1;
        unsigned RK4                    :1;
        unsigned RK5                    :1;
        unsigned RK6                    :1;
        unsigned RK7                    :1;
    };
} TRISKbits_t;
