GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile DDRJbits_t DDRJbits __at(0xF9A);
// bitfield macros
#define _DDRJ_TRISJ0_POSN                                   0x0
#define _DDRJ_TRISJ0_POSITION                               0x0
#define _DDRJ_TRISJ0_SIZE                                   0x1
#define _DDRJ_TRISJ0_LENGTH                                 0x1
#define _DDRJ_TRISJ0_MASK                                   0x1
#define _DDRJ_TRISJ1_POSN                                   0x1
#define _DDRJ_TRISJ1_POSITION                               0x1
#define _DDRJ_TRISJ1_SIZE                                   0x1
#define _DDRJ_TRISJ1_LENGTH                                 0x1
#define _DDRJ_TRISJ1_MASK                                   0x2
#define _DDRJ_TRISJ2_POSN                                   0x2
#define _DDRJ_TRISJ2_POSITION                               0x2
#define _DDRJ_TRISJ2_SIZE                                   0x1
#define _DDRJ_TRISJ2_LENGTH                                 0x1
#define _DDRJ_TRISJ2_MASK                                   0x4
#define _DDRJ_TRISJ3_POSN                                   0x3
#define _DDRJ_TRISJ3_POSITION                               0x3
#define _DDRJ_TRISJ3_SIZE                                   0x1
#define _DDRJ_TRISJ3_LENGTH                                 0x1
#define _DDRJ_TRISJ3_MASK                                   0x8
#define _DDRJ_TRISJ4_POSN                                   0x4
#define _DDRJ_TRISJ4_POSITION                               0x4
#define _DDRJ_TRISJ4_SIZE                                   0x1
#define _DDRJ_TRISJ4_LENGTH                                 0x1
#define _DDRJ_TRISJ4_MASK                                   0x10
#define _DDRJ_TRISJ5_POSN                                   0x5
#define _DDRJ_TRISJ5_POSITION                               0x5
#define _DDRJ_TRISJ5_SIZE                                   0x1
#define _DDRJ_TRISJ5_LENGTH                                 0x1
#define _DDRJ_TRISJ5_MASK                                   0x20
#define _DDRJ_TRISJ6_POSN                                   0x6
#define _DDRJ_TRISJ6_POSITION                               0x6
#define _DDRJ_TRISJ6_SIZE                                   0x1
#define _DDRJ_TRISJ6_LENGTH                                 0x1
#define _DDRJ_TRISJ6_MASK                                   0x40
#define _DDRJ_TRISJ7_POSN                                   0x7
#define _DDRJ_TRISJ7_POSITION                               0x7
#define _DDRJ_TRISJ7_SIZE                                   0x1
#define _DDRJ_TRISJ7_LENGTH                                 0x1
#define _DDRJ_TRISJ7_MASK                                   0x80
#define _DDRJ_RJ0_POSN                                      0x0
#define _DDRJ_RJ0_POSITION                                  0x0
#define _DDRJ_RJ0_SIZE                                      0x1
#define _DDRJ_RJ0_LENGTH                                    0x1
#define _DDRJ_RJ0_MASK                                      0x1
#define _DDRJ_RJ1_POSN                                      0x1
#define _DDRJ_RJ1_POSITION                                  0x1
#define _DDRJ_RJ1_SIZE                                      0x1
#define _DDRJ_RJ1_LENGTH                                    0x1
#define _DDRJ_RJ1_MASK                                      0x2
#define _DDRJ_RJ2_POSN                                      0x2
#define _DDRJ_RJ2_POSITION                                  0x2
#define _DDRJ_RJ2_SIZE                                      0x1
#define _DDRJ_RJ2_LENGTH                                    0x1
#define _DDRJ_RJ2_MASK                                      0x4
#define _DDRJ_RJ3_POSN                                      0x3
#define _DDRJ_RJ3_POSITION                                  0x3
#define _DDRJ_RJ3_SIZE                                      0x1
#define _DDRJ_RJ3_LENGTH                                    0x1
#define _DDRJ_RJ3_MASK                                      0x8
#define _DDRJ_RJ4_POSN                                      0x4
#define _DDRJ_RJ4_POSITION                                  0x4
#define _DDRJ_RJ4_SIZE                                      0x1
#define _DDRJ_RJ4_LENGTH                                    0x1
#define _DDRJ_RJ4_MASK                                      0x10
#define _DDRJ_RJ5_POSN                                      0x5
#define _DDRJ_RJ5_POSITION                                  0x5
#define _DDRJ_RJ5_SIZE                                      0x1
#define _DDRJ_RJ5_LENGTH                                    0x1
#define _DDRJ_RJ5_MASK                                      0x20
#define _DDRJ_RJ6_POSN                                      0x6
#define _DDRJ_RJ6_POSITION                                  0x6
#define _DDRJ_RJ6_SIZE                                      0x1
#define _DDRJ_RJ6_LENGTH                                    0x1
#define _DDRJ_RJ6_MASK                                      0x40
#define _DDRJ_RJ7_POSN                                      0x7
#define _DDRJ_RJ7_POSITION                                  0x7
#define _DDRJ_RJ7_SIZE                                      0x1
#define _DDRJ_RJ7_LENGTH                                    0x1
#define _DDRJ_RJ7_MASK                                      0x80

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0xF9D);
#ifndef _LIB_BUILD
asm("PIE1 equ 0F9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned CCP1IE                 :1;
        unsigned SSPIE                  :1;
        unsigned TXIE                   :1;
        unsigned RCIE                   :1;
        unsigned ADIE                   :1;
        unsigned PSPIE                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0xF9D);
// bitfield macros
#define _PIE1_TMR1IE_POSN                                   0x0
#define _PIE1_TMR1IE_POSITION                               0x0
#define _PIE1_TMR1IE_SIZE                                   0x1
#define _PIE1_TMR1IE_LENGTH                                 0x1
#define _PIE1_TMR1IE_MASK                                   0x1
#define _PIE1_TMR2IE_POSN                                   0x1
#define _PIE1_TMR2IE_POSITION                               0x1
#define _PIE1_TMR2IE_SIZE                                   0x1
#define _PIE1_TMR2IE_LENGTH                                 0x1
#define _PIE1_TMR2IE_MASK                                   0x2
#define _PIE1_CCP1IE_POSN                                   0x2
#define _PIE1_CCP1IE_POSITION                               0x2
#define _PIE1_CCP1IE_SIZE                                   0x1
#define _PIE1_CCP1IE_LENGTH                                 0x1
#define _PIE1_CCP1IE_MASK                                   0x4
#define _PIE1_SSPIE_POSN                                    0x3
#define _PIE1_SSPIE_POSITION                                0x3
#define _PIE1_SSPIE_SIZE                                    0x1
#define _PIE1_SSPIE_LENGTH                                  0x1
#define _PIE1_SSPIE_MASK                                    0x8
#define _PIE1_TXIE_POSN                                     0x4
#define _PIE1_TXIE_POSITION                                 0x4
#define _PIE1_TXIE_SIZE                                     0x1
#define _PIE1_TXIE_LENGTH                                   0x1
#define _PIE1_TXIE_MASK                                     0x10
#define _PIE1_RCIE_POSN                                     0x5
#define _PIE1_RCIE_POSITION                                 0x5
#define _PIE1_RCIE_SIZE                                     0x1
#define _PIE1_RCIE_LENGTH                                   0x1
#define _PIE1_RCIE_MASK                                     0x20
#define _PIE1_ADIE_POSN                                     0x6
#define _PIE1_ADIE_POSITION                                 0x6
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x40
#define _PIE1_PSPIE_POSN                                    0x7
#define _PIE1_PSPIE_POSITION                                0x7
#define _PIE1_PSPIE_SIZE                                    0x1
#define _PIE1_PSPIE_LENGTH                                  0x1
#define _PIE1_PSPIE_MASK                                    0x80
#define _PIE1_TX1IE_POSN                                    0x4
#define _PIE1_TX1IE_POSITION                                0x4
#define _PIE1_TX1IE_SIZE                                    0x1
#define _PIE1_TX1IE_LENGTH                                  0x1
#define _PIE1_TX1IE_MASK                                    0x10
#define _PIE1_RC1IE_POSN                                    0x5
#define _PIE1_RC1IE_POSITION                                0x5
#define _PIE1_RC1IE_SIZE                                    0x1
#define _PIE1_RC1IE_LENGTH                                  0x1
#define _PIE1_RC1IE_MASK                                    0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0xF9E);
#ifndef _LIB_BUILD
asm("PIR1 equ 0F9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned CCP1IF                 :1;
        unsigned SSPIF                  :1;
        unsigned TXIF                   :1;
        unsigned RCIF                   :1;
        unsigned ADIF                   :1;
        unsigned PSPIF                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
    };
} PIR1bits_t;
