GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile IPR3bits_t IPR3bits __at(0xFA5);
// bitfield macros
#define _IPR3_RXB0IP_POSN                                   0x0
#define _IPR3_RXB0IP_POSITION                               0x0
#define _IPR3_RXB0IP_SIZE                                   0x1
#define _IPR3_RXB0IP_LENGTH                                 0x1
#define _IPR3_RXB0IP_MASK                                   0x1
#define _IPR3_RXB1IP_POSN                                   0x1
#define _IPR3_RXB1IP_POSITION                               0x1
#define _IPR3_RXB1IP_SIZE                                   0x1
#define _IPR3_RXB1IP_LENGTH                                 0x1
#define _IPR3_RXB1IP_MASK                                   0x2
#define _IPR3_TXB0IP_POSN                                   0x2
#define _IPR3_TXB0IP_POSITION                               0x2
#define _IPR3_TXB0IP_SIZE                                   0x1
#define _IPR3_TXB0IP_LENGTH                                 0x1
#define _IPR3_TXB0IP_MASK                                   0x4
#define _IPR3_TXB1IP_POSN                                   0x3
#define _IPR3_TXB1IP_POSITION                               0x3
#define _IPR3_TXB1IP_SIZE                                   0x1
#define _IPR3_TXB1IP_LENGTH                                 0x1
#define _IPR3_TXB1IP_MASK                                   0x8
#define _IPR3_TXB2IP_POSN                                   0x4
#define _IPR3_TXB2IP_POSITION                               0x4
#define _IPR3_TXB2IP_SIZE                                   0x1
#define _IPR3_TXB2IP_LENGTH                                 0x1
#define _IPR3_TXB2IP_MASK                                   0x10
#define _IPR3_ERRIP_POSN                                    0x5
#define _IPR3_ERRIP_POSITION                                0x5
#define _IPR3_ERRIP_SIZE                                    0x1
#define _IPR3_ERRIP_LENGTH                                  0x1
#define _IPR3_ERRIP_MASK                                    0x20
#define _IPR3_WAKIP_POSN                                    0x6
#define _IPR3_WAKIP_POSITION                                0x6
#define _IPR3_WAKIP_SIZE                                    0x1
#define _IPR3_WAKIP_LENGTH                                  0x1
#define _IPR3_WAKIP_MASK                                    0x40
#define _IPR3_IRXIP_POSN                                    0x7
#define _IPR3_IRXIP_POSITION                                0x7
#define _IPR3_IRXIP_SIZE                                    0x1
#define _IPR3_IRXIP_LENGTH                                  0x1
#define _IPR3_IRXIP_MASK                                    0x80
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

// Register: RCSTA
#define RCSTA RCSTA
extern volatile unsigned char           RCSTA               __at(0xFAB);
#ifndef _LIB_BUILD
asm("RCSTA equ 0FABh");
#endif
// aliases
extern volatile unsigned char           COM1CON             __at(0xFAB);
#ifndef _LIB_BUILD
asm("COM1CON equ 0FABh");
#endif
extern volatile unsigned char           RCSTA1              __at(0xFAB);
#ifndef _LIB_BUILD
asm("RCSTA1 equ 0FABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned ADEN                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned SRENA                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC8_9                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC9                    :1;
    };
    struct {
        unsigned RCD8                   :1;
    };
} RCSTAbits_t;
extern volatile RCSTAbits_t RCSTAbits __at(0xFAB);
// bitfield macros
#define _RCSTA_RX9D_POSN                                    0x0
#define _RCSTA_RX9D_POSITION                                0x0
#define _RCSTA_RX9D_SIZE                                    0x1
#define _RCSTA_RX9D_LENGTH                                  0x1
#define _RCSTA_RX9D_MASK                                    0x1
#define _RCSTA_OERR_POSN                                    0x1
#define _RCSTA_OERR_POSITION                                0x1
#define _RCSTA_OERR_SIZE                                    0x1
#define _RCSTA_OERR_LENGTH                                  0x1
#define _RCSTA_OERR_MASK                                    0x2
#define _RCSTA_FERR_POSN                                    0x2
#define _RCSTA_FERR_POSITION                                0x2
#define _RCSTA_FERR_SIZE                                    0x1
#define _RCSTA_FERR_LENGTH                                  0x1
#define _RCSTA_FERR_MASK                                    0x4
#define _RCSTA_ADDEN_POSN                                   0x3
#define _RCSTA_ADDEN_POSITION                               0x3
#define _RCSTA_ADDEN_SIZE                                   0x1
#define _RCSTA_ADDEN_LENGTH                                 0x1
#define _RCSTA_ADDEN_MASK                                   0x8
#define _RCSTA_CREN_POSN                                    0x4
#define _RCSTA_CREN_POSITION                                0x4
#define _RCSTA_CREN_SIZE                                    0x1
#define _RCSTA_CREN_LENGTH                                  0x1
#define _RCSTA_CREN_MASK                                    0x10
#define _RCSTA_SREN_POSN                                    0x5
#define _RCSTA_SREN_POSITION                                0x5
#define _RCSTA_SREN_SIZE                                    0x1
#define _RCSTA_SREN_LENGTH                                  0x1
#define _RCSTA_SREN_MASK                                    0x20
#define _RCSTA_RX9_POSN                                     0x6
#define _RCSTA_RX9_POSITION                                 0x6
#define _RCSTA_RX9_SIZE                                     0x1
#define _RCSTA_RX9_LENGTH                                   0x1
#define _RCSTA_RX9_MASK                                     0x40
#define _RCSTA_SPEN_POSN                                    0x7
#define _RCSTA_SPEN_POSITION                                0x7
#define _RCSTA_SPEN_SIZE                                    0x1
#define _RCSTA_SPEN_LENGTH                                  0x1
#define _RCSTA_SPEN_MASK                                    0x80
#define _RCSTA_ADEN_POSN                                    0x3
#define _RCSTA_ADEN_POSITION                                0x3
#define _RCSTA_ADEN_SIZE                                    0x1
#define _RCSTA_ADEN_LENGTH                                  0x1
#define _RCSTA_ADEN_MASK                                    0x8
#define _RCSTA_SRENA_POSN                                   0x5
#define _RCSTA_SRENA_POSITION                               0x5
#define _RCSTA_SRENA_SIZE                                   0x1
#define _RCSTA_SRENA_LENGTH                                 0x1
#define _RCSTA_SRENA_MASK                                   0x20
#define _RCSTA_RC8_9_POSN                                   0x6
#define _RCSTA_RC8_9_POSITION                               0x6
#define _RCSTA_RC8_9_SIZE                                   0x1
#define _RCSTA_RC8_9_LENGTH                                 0x1
#define _RCSTA_RC8_9_MASK                                   0x40
#define _RCSTA_RC9_POSN                                     0x6
#define _RCSTA_RC9_POSITION                                 0x6
#define _RCSTA_RC9_SIZE                                     0x1
#define _RCSTA_RC9_LENGTH                                   0x1
#define _RCSTA_RC9_MASK                                     0x40
#define _RCSTA_RCD8_POSN                                    0x0
#define _RCSTA_RCD8_POSITION                                0x0
#define _RCSTA_RCD8_SIZE                                    0x1
#define _RCSTA_RCD8_LENGTH                                  0x1
#define _RCSTA_RCD8_MASK                                    0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned ADEN                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned SRENA                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC8_9                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC9                    :1;
    };
    struct {
        unsigned RCD8                   :1;
    };
} COM1CONbits_t;
extern volatile COM1CONbits_t COM1CONbits __at(0xFAB);
// bitfield macros
#define _COM1CON_RX9D_POSN                                  0x0
#define _COM1CON_RX9D_POSITION                              0x0
#define _COM1CON_RX9D_SIZE                                  0x1
#define _COM1CON_RX9D_LENGTH                                0x1
#define _COM1CON_RX9D_MASK                                  0x1
#define _COM1CON_OERR_POSN                                  0x1
#define _COM1CON_OERR_POSITION                              0x1
#define _COM1CON_OERR_SIZE                                  0x1
#define _COM1CON_OERR_LENGTH                                0x1
#define _COM1CON_OERR_MASK                                  0x2
#define _COM1CON_FERR_POSN                                  0x2
#define _COM1CON_FERR_POSITION                              0x2
#define _COM1CON_FERR_SIZE                                  0x1
#define _COM1CON_FERR_LENGTH                                0x1
#define _COM1CON_FERR_MASK                                  0x4
#define _COM1CON_ADDEN_POSN                                 0x3
#define _COM1CON_ADDEN_POSITION                             0x3
#define _COM1CON_ADDEN_SIZE                                 0x1
#define _COM1CON_ADDEN_LENGTH                               0x1
#define _COM1CON_ADDEN_MASK                                 0x8
#define _COM1CON_CREN_POSN                                  0x4
#define _COM1CON_CREN_POSITION                              0x4
#define _COM1CON_CREN_SIZE                                  0x1
#define _COM1CON_CREN_LENGTH                                0x1
#define _COM1CON_CREN_MASK                                  0x10
#define _COM1CON_SREN_POSN                                  0x5
#define _COM1CON_SREN_POSITION                              0x5
#define _COM1CON_SREN_SIZE                                  0x1
#define _COM1CON_SREN_LENGTH                                0x1
#define _COM1CON_SREN_MASK                                  0x20
#define _COM1CON_RX9_POSN                                   0x6
#define _COM1CON_RX9_POSITION                               0x6
#define _COM1CON_RX9_SIZE                                   0x1
#define _COM1CON_RX9_LENGTH                                 0x1
#define _COM1CON_RX9_MASK                                   0x40
#define _COM1CON_SPEN_POSN                                  0x7
#define _COM1CON_SPEN_POSITION                              0x7
#define _COM1CON_SPEN_SIZE                                  0x1
#define _COM1CON_SPEN_LENGTH                                0x1
#define _COM1CON_SPEN_MASK                                  0x80
#define _COM1CON_ADEN_POSN                                  0x3
#define _COM1CON_ADEN_POSITION                              0x3
#define _COM1CON_ADEN_SIZE                                  0x1
#define _COM1CON_ADEN_LENGTH                                0x1
#define _COM1CON_ADEN_MASK                                  0x8
#define _COM1CON_SRENA_POSN                                 0x5
#define _COM1CON_SRENA_POSITION                             0x5
#define _COM1CON_SRENA_SIZE                                 0x1
#define _COM1CON_SRENA_LENGTH                               0x1
#define _COM1CON_SRENA_MASK                                 0x20
#define _COM1CON_RC8_9_POSN                                 0x6
#define _COM1CON_RC8_9_POSITION                             0x6
#define _COM1CON_RC8_9_SIZE                                 0x1
#define _COM1CON_RC8_9_LENGTH                               0x1
#define _COM1CON_RC8_9_MASK                                 0x40
#define _COM1CON_RC9_POSN                                   0x6
#define _COM1CON_RC9_POSITION                               0x6
#define _COM1CON_RC9_SIZE                                   0x1
#define _COM1CON_RC9_LENGTH                                 0x1
#define _COM1CON_RC9_MASK                                   0x40
#define _COM1CON_RCD8_POSN                                  0x0
#define _COM1CON_RCD8_POSITION                              0x0
#define _COM1CON_RCD8_SIZE                                  0x1
#define _COM1CON_RCD8_LENGTH                                0x1
#define _COM1CON_RCD8_MASK                                  0x1
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned ADEN                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned SRENA                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC8_9                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC9                    :1;
    };
    struct {
        unsigned RCD8                   :1;
    };
} RCSTA1bits_t;
extern volatile RCSTA1bits_t RCSTA1bits __at(0xFAB);
// bitfield macros
#define _RCSTA1_RX9D_POSN                                   0x0
#define _RCSTA1_RX9D_POSITION                               0x0
#define _RCSTA1_RX9D_SIZE                                   0x1
#define _RCSTA1_RX9D_LENGTH                                 0x1
#define _RCSTA1_RX9D_MASK                                   0x1
#define _RCSTA1_OERR_POSN                                   0x1
#define _RCSTA1_OERR_POSITION                               0x1
#define _RCSTA1_OERR_SIZE                                   0x1
#define _RCSTA1_OERR_LENGTH                                 0x1
#define _RCSTA1_OERR_MASK                                   0x2
#define _RCSTA1_FERR_POSN                                   0x2
#define _RCSTA1_FERR_POSITION                               0x2
#define _RCSTA1_FERR_SIZE                                   0x1
#define _RCSTA1_FERR_LENGTH                                 0x1
#define _RCSTA1_FERR_MASK                                   0x4
#define _RCSTA1_ADDEN_POSN                                  0x3
#define _RCSTA1_ADDEN_POSITION                              0x3
#define _RCSTA1_ADDEN_SIZE                                  0x1
#define _RCSTA1_ADDEN_LENGTH                                0x1
#define _RCSTA1_ADDEN_MASK                                  0x8
#define _RCSTA1_CREN_POSN                                   0x4
#define _RCSTA1_CREN_POSITION                               0x4
#define _RCSTA1_CREN_SIZE                                   0x1
#define _RCSTA1_CREN_LENGTH                                 0x1
#define _RCSTA1_CREN_MASK                                   0x10
#define _RCSTA1_SREN_POSN                                   0x5
#define _RCSTA1_SREN_POSITION                               0x5
#define _RCSTA1_SREN_SIZE                                   0x1
#define _RCSTA1_SREN_LENGTH                                 0x1
#define _RCSTA1_SREN_MASK                                   0x20
#define _RCSTA1_RX9_POSN                                    0x6
#define _RCSTA1_RX9_POSITION                                0x6
#define _RCSTA1_RX9_SIZE                                    0x1
#define _RCSTA1_RX9_LENGTH                                  0x1
#define _RCSTA1_RX9_MASK                                    0x40
#define _RCSTA1_SPEN_POSN                                   0x7
#define _RCSTA1_SPEN_POSITION                               0x7
#define _RCSTA1_SPEN_SIZE                                   0x1
#define _RCSTA1_SPEN_LENGTH                                 0x1
#define _RCSTA1_SPEN_MASK                                   0x80
#define _RCSTA1_ADEN_POSN                                   0x3
#define _RCSTA1_ADEN_POSITION                               0x3
#define _RCSTA1_ADEN_SIZE                                   0x1
#define _RCSTA1_ADEN_LENGTH                                 0x1
#define _RCSTA1_ADEN_MASK                                   0x8
#define _RCSTA1_SRENA_POSN                                  0x5
#define _RCSTA1_SRENA_POSITION                              0x5
#define _RCSTA1_SRENA_SIZE                                  0x1
#define _RCSTA1_SRENA_LENGTH                                0x1
#define _RCSTA1_SRENA_MASK                                  0x20
#define _RCSTA1_RC8_9_POSN                                  0x6
#define _RCSTA1_RC8_9_POSITION                              0x6
#define _RCSTA1_RC8_9_SIZE                                  0x1
#define _RCSTA1_RC8_9_LENGTH                                0x1
#define _RCSTA1_RC8_9_MASK                                  0x40
#define _RCSTA1_RC9_POSN                                    0x6
#define _RCSTA1_RC9_POSITION                                0x6
#define _RCSTA1_RC9_SIZE                                    0x1
#define _RCSTA1_RC9_LENGTH                                  0x1
#define _RCSTA1_RC9_MASK                                    0x40
#define _RCSTA1_RCD8_POSN                                   0x0
#define _RCSTA1_RCD8_POSITION                               0x0
#define _RCSTA1_RCD8_SIZE                                   0x1
#define _RCSTA1_RCD8_LENGTH                                 0x1
#define _RCSTA1_RCD8_MASK                                   0x1

// Register: TXSTA
#define TXSTA TXSTA
extern volatile unsigned char           TXSTA               __at(0xFAC);
#ifndef _LIB_BUILD
asm("TXSTA equ 0FACh");
#endif
// aliases
extern volatile unsigned char           COM1STA             __at(0xFAC);
#ifndef _LIB_BUILD
asm("COM1STA equ 0FACh");
#endif
extern volatile unsigned char           TXSTA1              __at(0xFAC);
#ifndef _LIB_BUILD
asm("TXSTA1 equ 0FACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
    struct {
        unsigned TX9D1                  :1;
        unsigned TRMT1                  :1;
        unsigned BRGH1                  :1;
        unsigned                        :1;
        unsigned SYNC1                  :1;
        unsigned TXEN1                  :1;
        unsigned TX91                   :1;
        unsigned CSRC1                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TX8_9                  :1;
    };
    struct {
        unsigned TXD8                   :1;
    };
} TXSTAbits_t;
