GopalSaraf/Practicals/PSDL/include/proc/pic18c858.h
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// PORTE<NOT_RD>
extern volatile __bit                   NOT_RD              __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 NOT_RD_bit          _BIT_ACCESS(PORTE,0)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// SSPSTAT<NOT_W>
extern volatile __bit                   NOT_W               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_W_bit           _BIT_ACCESS(SSPSTAT,2)
// PORTE<NOT_WR>
extern volatile __bit                   NOT_WR              __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 NOT_WR_bit          _BIT_ACCESS(PORTE,1)
// SSPSTAT<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(SSPSTAT,2)
// PSPCON<OBF>
extern volatile __bit                   OBF                 __at(0x7D86);	// @ (0xFB0 * 8 + 6)
#define                                 OBF_bit             _BIT_ACCESS(PSPCON,6)
// RCSTA<OERR>
extern volatile __bit                   OERR                __at(0x7D59);	// @ (0xFAB * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA,1)
// PORTA<OSC2>
extern volatile __bit                   OSC2                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 OSC2_bit            _BIT_ACCESS(PORTA,6)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTH<PB1>
extern volatile __bit                   PB1                 __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 PB1_bit             _BIT_ACCESS(PORTH,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PB1E_bit            _BIT_ACCESS(PORTE,6)
// PORTE<PB2>
extern volatile __bit                   PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTH<PB3>
extern volatile __bit                   PB3                 __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 PB3_bit             _BIT_ACCESS(PORTH,5)
// PORTE<PB3E>
extern volatile __bit                   PB3E                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PB3E_bit            _BIT_ACCESS(PORTE,4)
// PORTH<PC1>
extern volatile __bit                   PC1                 __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 PC1_bit             _BIT_ACCESS(PORTH,6)
// PORTE<PC1E>
extern volatile __bit                   PC1E                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PC1E_bit            _BIT_ACCESS(PORTE,5)
// PORTE<PC2>
extern volatile __bit                   PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTH<PC3>
extern volatile __bit                   PC3                 __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 PC3_bit             _BIT_ACCESS(PORTH,4)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// ADCON1<PCFG0>
extern volatile __bit                   PCFG0               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 PCFG0_bit           _BIT_ACCESS(ADCON1,0)
// ADCON1<PCFG1>
extern volatile __bit                   PCFG1               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 PCFG1_bit           _BIT_ACCESS(ADCON1,1)
// ADCON1<PCFG2>
extern volatile __bit                   PCFG2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 PCFG2_bit           _BIT_ACCESS(ADCON1,2)
// ADCON1<PCFG3>
extern volatile __bit                   PCFG3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 PCFG3_bit           _BIT_ACCESS(ADCON1,3)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// PORTE<PD2>
extern volatile __bit                   PD2                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSPCON2<PEN>
extern volatile __bit                   PEN                 __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSPCON2,2)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// BRGCON2<PRSEG0>
extern volatile __bit                   PRSEG0              __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 PRSEG0_bit          _BIT_ACCESS(BRGCON2,0)
// BRGCON2<PRSEG1>
extern volatile __bit                   PRSEG1              __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 PRSEG1_bit          _BIT_ACCESS(BRGCON2,1)
// BRGCON2<PRSEG2>
extern volatile __bit                   PRSEG2              __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 PRSEG2_bit          _BIT_ACCESS(BRGCON2,2)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PORTD<PSP0>
extern volatile __bit                   PSP0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 PSP0_bit            _BIT_ACCESS(PORTD,0)
// PORTD<PSP1>
extern volatile __bit                   PSP1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 PSP1_bit            _BIT_ACCESS(PORTD,1)
// PORTD<PSP2>
extern volatile __bit                   PSP2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 PSP2_bit            _BIT_ACCESS(PORTD,2)
// PORTD<PSP3>
extern volatile __bit                   PSP3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 PSP3_bit            _BIT_ACCESS(PORTD,3)
// PORTD<PSP4>
extern volatile __bit                   PSP4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 PSP4_bit            _BIT_ACCESS(PORTD,4)
// PORTD<PSP5>
extern volatile __bit                   PSP5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 PSP5_bit            _BIT_ACCESS(PORTD,5)
// PORTD<PSP6>
extern volatile __bit                   PSP6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 PSP6_bit            _BIT_ACCESS(PORTD,6)
// PORTD<PSP7>
extern volatile __bit                   PSP7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 PSP7_bit            _BIT_ACCESS(PORTD,7)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// PSPCON<PSPMODE>
extern volatile __bit                   PSPMODE             __at(0x7D84);	// @ (0xFB0 * 8 + 4)
#define                                 PSPMODE_bit         _BIT_ACCESS(PSPCON,4)
// PORTA<RA0>
extern volatile __bit _DEPRECATED       RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit _DEPRECATED       RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit _DEPRECATED       RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit _DEPRECATED       RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit _DEPRECATED       RA4                 __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit _DEPRECATED       RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit _DEPRECATED       RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTB<RB0>
extern volatile __bit _DEPRECATED       RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// RXB0D0<RB0D00>
extern volatile __bit                   RB0D00              __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 RB0D00_bit          _BIT_ACCESS(RXB0D0,0)
// RXB0D0<RB0D01>
extern volatile __bit                   RB0D01              __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 RB0D01_bit          _BIT_ACCESS(RXB0D0,1)
// RXB0D0<RB0D02>
extern volatile __bit                   RB0D02              __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 RB0D02_bit          _BIT_ACCESS(RXB0D0,2)
// RXB0D0<RB0D03>
extern volatile __bit                   RB0D03              __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 RB0D03_bit          _BIT_ACCESS(RXB0D0,3)
// RXB0D0<RB0D04>
extern volatile __bit                   RB0D04              __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 RB0D04_bit          _BIT_ACCESS(RXB0D0,4)
// RXB0D0<RB0D05>
extern volatile __bit                   RB0D05              __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 RB0D05_bit          _BIT_ACCESS(RXB0D0,5)
// RXB0D0<RB0D06>
extern volatile __bit                   RB0D06              __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 RB0D06_bit          _BIT_ACCESS(RXB0D0,6)
// RXB0D0<RB0D07>
extern volatile __bit                   RB0D07              __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 RB0D07_bit          _BIT_ACCESS(RXB0D0,7)
// RXB0D1<RB0D10>
extern volatile __bit                   RB0D10              __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 RB0D10_bit          _BIT_ACCESS(RXB0D1,0)
// RXB0D1<RB0D11>
extern volatile __bit                   RB0D11              __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 RB0D11_bit          _BIT_ACCESS(RXB0D1,1)
// RXB0D1<RB0D12>
extern volatile __bit                   RB0D12              __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 RB0D12_bit          _BIT_ACCESS(RXB0D1,2)
// RXB0D1<RB0D13>
extern volatile __bit                   RB0D13              __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 RB0D13_bit          _BIT_ACCESS(RXB0D1,3)
// RXB0D1<RB0D14>
extern volatile __bit                   RB0D14              __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 RB0D14_bit          _BIT_ACCESS(RXB0D1,4)
// RXB0D1<RB0D15>
extern volatile __bit                   RB0D15              __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RB0D15_bit          _BIT_ACCESS(RXB0D1,5)
// RXB0D1<RB0D16>
extern volatile __bit                   RB0D16              __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 RB0D16_bit          _BIT_ACCESS(RXB0D1,6)
// RXB0D1<RB0D17>
extern volatile __bit                   RB0D17              __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 RB0D17_bit          _BIT_ACCESS(RXB0D1,7)
// RXB0D2<RB0D20>
extern volatile __bit                   RB0D20              __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 RB0D20_bit          _BIT_ACCESS(RXB0D2,0)
// RXB0D2<RB0D21>
extern volatile __bit                   RB0D21              __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 RB0D21_bit          _BIT_ACCESS(RXB0D2,1)
// RXB0D2<RB0D22>
extern volatile __bit                   RB0D22              __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 RB0D22_bit          _BIT_ACCESS(RXB0D2,2)
// RXB0D2<RB0D23>
extern volatile __bit                   RB0D23              __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 RB0D23_bit          _BIT_ACCESS(RXB0D2,3)
// RXB0D2<RB0D24>
extern volatile __bit                   RB0D24              __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 RB0D24_bit          _BIT_ACCESS(RXB0D2,4)
// RXB0D2<RB0D25>
extern volatile __bit                   RB0D25              __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 RB0D25_bit          _BIT_ACCESS(RXB0D2,5)
// RXB0D2<RB0D26>
extern volatile __bit                   RB0D26              __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 RB0D26_bit          _BIT_ACCESS(RXB0D2,6)
// RXB0D2<RB0D27>
extern volatile __bit                   RB0D27              __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 RB0D27_bit          _BIT_ACCESS(RXB0D2,7)
// RXB0D3<RB0D30>
extern volatile __bit                   RB0D30              __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 RB0D30_bit          _BIT_ACCESS(RXB0D3,0)
// RXB0D3<RB0D31>
extern volatile __bit                   RB0D31              __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 RB0D31_bit          _BIT_ACCESS(RXB0D3,1)
// RXB0D3<RB0D32>
extern volatile __bit                   RB0D32              __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 RB0D32_bit          _BIT_ACCESS(RXB0D3,2)
// RXB0D3<RB0D33>
extern volatile __bit                   RB0D33              __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 RB0D33_bit          _BIT_ACCESS(RXB0D3,3)
// RXB0D3<RB0D34>
extern volatile __bit                   RB0D34              __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 RB0D34_bit          _BIT_ACCESS(RXB0D3,4)
// RXB0D3<RB0D35>
extern volatile __bit                   RB0D35              __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 RB0D35_bit          _BIT_ACCESS(RXB0D3,5)
// RXB0D3<RB0D36>
extern volatile __bit                   RB0D36              __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 RB0D36_bit          _BIT_ACCESS(RXB0D3,6)
// RXB0D3<RB0D37>
extern volatile __bit                   RB0D37              __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 RB0D37_bit          _BIT_ACCESS(RXB0D3,7)
// RXB0D4<RB0D40>
extern volatile __bit                   RB0D40              __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 RB0D40_bit          _BIT_ACCESS(RXB0D4,0)
// RXB0D4<RB0D41>
extern volatile __bit                   RB0D41              __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 RB0D41_bit          _BIT_ACCESS(RXB0D4,1)
// RXB0D4<RB0D42>
extern volatile __bit                   RB0D42              __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 RB0D42_bit          _BIT_ACCESS(RXB0D4,2)
// RXB0D4<RB0D43>
extern volatile __bit                   RB0D43              __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 RB0D43_bit          _BIT_ACCESS(RXB0D4,3)
// RXB0D4<RB0D44>
extern volatile __bit                   RB0D44              __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 RB0D44_bit          _BIT_ACCESS(RXB0D4,4)
// RXB0D4<RB0D45>
extern volatile __bit                   RB0D45              __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 RB0D45_bit          _BIT_ACCESS(RXB0D4,5)
// RXB0D4<RB0D46>
extern volatile __bit                   RB0D46              __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 RB0D46_bit          _BIT_ACCESS(RXB0D4,6)
// RXB0D4<RB0D47>
extern volatile __bit                   RB0D47              __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 RB0D47_bit          _BIT_ACCESS(RXB0D4,7)
// RXB0D5<RB0D50>
extern volatile __bit                   RB0D50              __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 RB0D50_bit          _BIT_ACCESS(RXB0D5,0)
// RXB0D5<RB0D51>
extern volatile __bit                   RB0D51              __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 RB0D51_bit          _BIT_ACCESS(RXB0D5,1)
// RXB0D5<RB0D52>
extern volatile __bit                   RB0D52              __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 RB0D52_bit          _BIT_ACCESS(RXB0D5,2)
// RXB0D5<RB0D53>
extern volatile __bit                   RB0D53              __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 RB0D53_bit          _BIT_ACCESS(RXB0D5,3)
// RXB0D5<RB0D54>
extern volatile __bit                   RB0D54              __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 RB0D54_bit          _BIT_ACCESS(RXB0D5,4)
// RXB0D5<RB0D55>
extern volatile __bit                   RB0D55              __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 RB0D55_bit          _BIT_ACCESS(RXB0D5,5)
// RXB0D5<RB0D56>
extern volatile __bit                   RB0D56              __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 RB0D56_bit          _BIT_ACCESS(RXB0D5,6)
// RXB0D5<RB0D57>
extern volatile __bit                   RB0D57              __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 RB0D57_bit          _BIT_ACCESS(RXB0D5,7)
// RXB0D6<RB0D60>
extern volatile __bit                   RB0D60              __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 RB0D60_bit          _BIT_ACCESS(RXB0D6,0)
// RXB0D6<RB0D61>
extern volatile __bit                   RB0D61              __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 RB0D61_bit          _BIT_ACCESS(RXB0D6,1)
// RXB0D6<RB0D62>
extern volatile __bit                   RB0D62              __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 RB0D62_bit          _BIT_ACCESS(RXB0D6,2)
// RXB0D6<RB0D63>
extern volatile __bit                   RB0D63              __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 RB0D63_bit          _BIT_ACCESS(RXB0D6,3)
// RXB0D6<RB0D64>
extern volatile __bit                   RB0D64              __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 RB0D64_bit          _BIT_ACCESS(RXB0D6,4)
// RXB0D6<RB0D65>
extern volatile __bit                   RB0D65              __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 RB0D65_bit          _BIT_ACCESS(RXB0D6,5)
// RXB0D6<RB0D66>
extern volatile __bit                   RB0D66              __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 RB0D66_bit          _BIT_ACCESS(RXB0D6,6)
// RXB0D6<RB0D67>
extern volatile __bit                   RB0D67              __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 RB0D67_bit          _BIT_ACCESS(RXB0D6,7)
// RXB0D7<RB0D70>
extern volatile __bit                   RB0D70              __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 RB0D70_bit          _BIT_ACCESS(RXB0D7,0)
// RXB0D7<RB0D71>
extern volatile __bit                   RB0D71              __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 RB0D71_bit          _BIT_ACCESS(RXB0D7,1)
// RXB0D7<RB0D72>
extern volatile __bit                   RB0D72              __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 RB0D72_bit          _BIT_ACCESS(RXB0D7,2)
// RXB0D7<RB0D73>
extern volatile __bit                   RB0D73              __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 RB0D73_bit          _BIT_ACCESS(RXB0D7,3)
// RXB0D7<RB0D74>
extern volatile __bit                   RB0D74              __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 RB0D74_bit          _BIT_ACCESS(RXB0D7,4)
// RXB0D7<RB0D75>
